In [2]:
import pandas as pd
df_produtos = pd.DataFrame({'nome': ['ovos', 'manteiga', 'peixe'],
                   'valor': [10, 20, 30]})
df_produtos

       nome  valor
0      ovos     10
1  manteiga     20
2     peixe     30

In [1]:
import sqlite3

In [3]:
#conectar ao banco de dados existente ou criar um banco. Para criar basta escrever o nome do banco e colocar a extensão .bd (ex: 'aula_9.bd) 

conn = sqlite3.connect('coderhouse1.db')

# Escreva o DataFrame na tabela 'produtos'

df_produtos.to_sql('produtos', conn, if_exists='replace', index=False)

# Fecha a conexão com o banco de dados 

conn.close()

In [14]:
#Consulta uma tabela do banco de dados 

conn = sqlite3.connect('coderhouse1.db')

#Executar uma consulta SELECT na tabela 'produtos' e converter em um DataFrame

query = "SELECT * FROM produtos"
df_prod = pd.read_sql(query, conn)
print(df_prod)

conn.close()

       nome  valor
0      ovos     10
1  manteiga     20
2     peixe     30

In [33]:
# Listar as tabelas 

conn = sqlite3.connect('coderhouse1.db')

# Executar uma consulta que retorna as informações do esquema do banco de dados 

query = "SELECT name FROM sqlite_master WHERE type= 'table'"
schema = pd.read_sql_query(query, conn)

#Imprimir o  DataFrame com os nomes das tabelas 

print(schema)

conn.close()

       name
0  fastfood
1  produtos

----

In [22]:
#criando um novo banco 
conn = sqlite3.connect('aula_bd.db')

In [9]:
import pandas as pd

%pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\regia\appdata\local\programs\python\python311\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\regia\appdata\local\programs\python\python311\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.1.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [10]:
#realizado a leitura do arquivo excel para criar o dataframe 

df = pd.read_excel('fastfood.xlsx')

In [20]:
df.head(2)

,restaurant,item,calories,cal_fat,total_fat,sat_fat,trans_fat,cholesterol,sodium,total_carb,fiber,sugar,protein,vit_a,vit_c,calcium,salad
0,Mcdonalds,Artisan Grilled Chicken Sandwich,380,60,7,2,0,95,1110,44,3.0,11,37.0,4.0,20.0,20.0,Other
1,Mcdonalds,Single Bacon Smokehouse Burger,840,410,45,17,2023-05-01 00:00:00,130,1580,62,2.0,18,46.0,6.0,20.0,20.0,Other

In [23]:
# salvando a tabela no banco 

#        Nome da tabela, a conexão que criou com o banco de dados (linha 12), se existir essa tabela substitui (replace), Não quero que leve o indice do dataframe 

df.to_sql('fastfood', conn, if_exists='replace', index=False)

515

In [24]:
conn.close()

In [25]:
#Consulta uma tabela do banco de dados 

# iniciando a conexão com o banco de dados 
conn = sqlite3.connect('aula_bd.db')

# fazendo a leitura 
       #Selecione coluna calories da tabela fastfood  
query = 'SELECT calories FROM fastfood'
df_calories = pd.read_sql(query,conn)

In [27]:
df_calories.head()

   calories
0       380
1       840
2      1130
3       750
4       920

In [28]:
# selecionando tudo da tabela fastfood 

query = 'SELECT * FROM fastfood'
df_total = pd.read_sql(query,conn)

In [29]:
df_total.head(2)

,restaurant,item,calories,cal_fat,total_fat,sat_fat,trans_fat,cholesterol,sodium,total_carb,fiber,sugar,protein,vit_a,vit_c,calcium,salad
0,Mcdonalds,Artisan Grilled Chicken Sandwich,380,60,7,2,0,95,1110,44,3.0,11,37.0,4.0,20.0,20.0,Other
1,Mcdonalds,Single Bacon Smokehouse Burger,840,410,45,17,1682910000,130,1580,62,2.0,18,46.0,6.0,20.0,20.0,Other

In [30]:
# selecionando tudo da tabela fastfood e sendo mais especifico (where) condição/filtro 

query = 'SELECT * FROM fastfood WHERE calories <= 25'
df_total_filtro = pd.read_sql(query,conn)

In [31]:
df_total_filtro

,restaurant,item,calories,cal_fat,total_fat,sat_fat,trans_fat,cholesterol,sodium,total_carb,fiber,sugar,protein,vit_a,vit_c,calcium,salad
0,Dairy Queen,Side Salad,20,0,0,0,0,0,15,5,2.0,3,1.0,50.0,30.0,15.0,Other

In [32]:
conn.close()

In [34]:
# iniciando a conexão com o banco de dados 
conn = sqlite3.connect('aula_bd.db')

In [35]:
# query puxando todas as informações de todas as tabelas salvas no banco de dados

query = "SELECT * FROM sqlite_master WHERE type = 'table'"
schema1 = pd.read_sql_query(query, conn)

In [36]:
schema1

,type,name,tbl_name,rootpage,sql
0,table,fastfood,fastfood,2,"CREATE TABLE ""fastfood"" (\n""restaurant"" TEXT,\..."

In [37]:
# pegando só o nome das tabelas do banco de dados 

query = "SELECT name FROM sqlite_master WHERE type = 'table'"
schema2 = pd.read_sql_query(query, conn)

In [38]:
schema2

       name
0  fastfood

In [39]:
conn.close()

1:12:28